app/controllers/contacts_controller.rb

  def create
    @contact = Contact.new(contact_params)
    if @contact.save
---
INSERT INTO "contacts" ("name", "email", "comments", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "yoosters "], ["email", "test@testing.com"], ["comments", "j[djej[dqefj[0qejfqefeqee"], ["created_at", 2020-05-29 17:42:32 UTC], ["updated_at", 2020-05-29 17:42:32 UTC]]